powermax_threads10_AOF_on_result_200508/thread_10_nvm_sw_aofon_1.txt
shm_addr = 7000
shm_addr = 7000
shm_addr = 7000
[...]
======================================
 all_ops == 1000000
 test_time == 16.191260
 Throughput == 61761.715889
 ======================================
10        Threads
1         Connections per thread
100000    Requests per client


ALL STATS
=========================================================================
Type         Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
-------------------------------------------------------------------------
Sets        61610.38          ---          ---      0.15900     64551.78 
Gets            0.00         0.00         0.00      0.00000         0.00 
Waits           0.00          ---          ---      0.00000          --- 
Totals      61610.38         0.00         0.00      0.15900     64551.78 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.039         0.00
SET       0.040         0.00
SET       0.041         0.00
SET       0.042         0.00
SET       0.043         0.01
SET       0.044         0.03
SET       0.045         0.05
SET       0.046         0.09
SET       0.047         0.13
SET       0.048         0.17
SET       0.049         0.20
SET       0.050         0.21
SET       0.051         0.22
SET       0.052         0.23
SET       0.053         0.25
SET       0.054         0.26
SET       0.055         0.29
SET       0.056         0.30
SET       0.057         0.31
SET       0.058         0.32
SET       0.059         0.32
SET       0.060         0.32
SET       0.061         0.33
SET       0.062         0.34
SET       0.063         0.34
SET       0.064         0.35
SET       0.065         0.37
SET       0.066         0.39
SET       0.067         0.41
SET       0.068         0.43
SET       0.069         0.44
SET       0.070         0.45
SET       0.071         0.46
SET       0.072         0.48
SET       0.073         0.50
SET       0.074         0.52
SET       0.075         0.53
SET       0.076         0.53
SET       0.077         0.54
SET       0.078         0.55
SET       0.079         0.56
SET       0.080         0.57
SET       0.081         0.58
SET       0.082         0.59
SET       0.083         0.61
SET       0.084         0.62
SET       0.085         0.63
SET       0.086         0.65
SET       0.087         0.66
SET       0.088         0.67
SET       0.089         0.68
SET       0.090         0.69
SET       0.091         0.71
SET       0.092         0.72
SET       0.093         0.74
SET       0.094         0.75
SET       0.095         0.77
SET       0.096         0.79
SET       0.097         0.81
SET       0.098         0.84
SET       0.099         0.87
SET       0.100         1.11
SET       0.110         5.79
SET       0.120        23.29
SET       0.130        44.20
SET       0.140        59.86
SET       0.150        69.19
SET       0.160        75.49
SET       0.170        80.59
SET       0.180        85.58
SET       0.190        90.40
SET       0.200        94.00
SET       0.210        96.37
SET       0.220        97.86
SET       0.230        98.69
SET       0.240        99.12
SET       0.250        99.37
SET       0.260        99.53
SET       0.270        99.63
SET       0.280        99.70
SET       0.290        99.75
SET       0.300        99.78
SET       0.310        99.80
SET       0.320        99.82
SET       0.330        99.83
SET       0.340        99.83
SET       0.350        99.84
SET       0.360        99.84
SET       0.370        99.85
SET       0.380        99.86
SET       0.390        99.86
SET       0.400        99.87
SET       0.410        99.87
SET       0.420        99.88
SET       0.430        99.88
SET       0.440        99.89
SET       0.450        99.89
SET       0.460        99.89
SET       0.470        99.89
SET       0.480        99.89
SET       0.490        99.89
SET       0.500        99.90
SET       0.510        99.90
SET       0.520        99.90
SET       0.530        99.90
SET       0.540        99.90
SET       0.550        99.90
SET       0.560        99.90
SET       0.570        99.90
SET       0.580        99.91
SET       0.590        99.91
SET       0.600        99.91
SET       0.610        99.91
SET       0.620        99.91
SET       0.630        99.91
SET       0.640        99.91
SET       0.650        99.91
SET       0.660        99.91
SET       0.670        99.91
SET       0.680        99.92
SET       0.690        99.92
SET       0.700        99.92
SET       0.710        99.92
SET       0.720        99.92
SET       0.730        99.92
SET       0.740        99.92
SET       0.750        99.92
SET       0.760        99.92
SET       0.770        99.92
SET       0.780        99.92
SET       0.790        99.93
SET       0.800        99.93
SET       0.810        99.93
SET       0.820        99.93
SET       0.830        99.93
SET       0.840        99.93
SET       0.850        99.93
SET       0.860        99.93
SET       0.870        99.93
SET       0.880        99.93
SET       0.890        99.93
SET       0.900        99.93
SET       0.910        99.93
SET       0.920        99.93
SET       0.930        99.93
SET       0.940        99.93
SET       0.970        99.93
SET       0.990        99.93
SET       1.000        99.94
SET       1.100        99.94
SET       1.200        99.94
SET       1.300        99.94
SET       1.400        99.94
SET       1.500        99.94
SET       1.600        99.94
SET       1.900        99.94
SET       2.000        99.95
SET       2.100        99.95
SET       2.200        99.95
SET       2.400        99.95
SET       2.500        99.95
SET       2.600        99.95
SET       2.700        99.95
SET       2.800        99.95
SET       2.900        99.95
SET       3.000        99.95
SET       3.100        99.95
SET       3.200        99.95
SET       3.400        99.95
SET       3.500        99.95
SET       3.600        99.95
SET       3.700        99.95
SET       3.800        99.96
SET       3.900        99.96
SET       4.000        99.96
SET       4.100        99.96
SET       4.400        99.96
SET       4.500        99.96
SET       4.600        99.96
SET       4.700        99.96
SET       4.900        99.96
SET       5.400        99.96
SET       5.500        99.96
SET       5.600        99.97
SET       5.700        99.97
SET       5.800        99.97
SET       6.400        99.97
SET       6.500        99.97
SET       7.000        99.97
SET       7.100        99.97
SET       7.200        99.97
SET       7.600        99.97
SET       7.700        99.97
SET       7.800        99.97
SET       7.900        99.97
SET       8.000        99.97
SET       8.100        99.97
SET       8.200        99.97
SET       8.700        99.97
SET       8.800        99.98
SET       8.900        99.98
SET       9.000        99.98
SET       9.100        99.98
SET       9.200        99.98
SET       9.500        99.98
SET       9.600        99.98
SET      10.000        99.98
SET      11.000        99.98
SET      12.000        99.98
SET      14.000        99.98
SET      15.000        99.98
SET      16.000        99.99
SET      18.000        99.99
SET      20.000        99.99
SET      21.000        99.99
SET      24.000        99.99
SET      25.000        99.99
SET      27.000        99.99
SET      28.000        99.99
SET      31.000        99.99
SET      32.000        99.99
SET      37.000        99.99
SET      38.000       100.00
SET      69.000       100.00
SET     120.000       100.00
SET     130.000       100.00
SET     170.000       100.00
SET     180.000       100.00
---
---